// Создать функцию, которая принимает массив строк и строку.
// Функция должна вернуть новый массив, содержащий только те элементы первого массива,
// которые начинаются со второй строки. Регистр символов не влияет на результат.


const product = ['Молоко', 'Молочные берега', 'Сок', 'Творог', 'Йогурт'];
const search = 'м';
// Используем filter для создания нового массива
const result = product.filter(item => {

//Приводим  и элемент, и искомую к сьроку к нижнему регистру

return item.toLowerCase().startsWith(search.toLowerCase());
});

console.log(result);
  // В результате будет выведено 'Молоко', 'Молочные берега'