// Округлить число 32.58884:
// До меньшего целого.
// До большего целого.
// До ближайшего целого.

let num = 32.58884;
//  До меньшего целого (Floor)
 // Math.floor() отбрасывает дробную часть.
 // Для 32.58884 результат будет 32.
console.log(Math.floor(num));
//  До большего целого (Ceil)
 // Math.ceil() всегда округляет вверх.
  // Для 32.58884 результат будет 33.
console.log(Math.ceil(num));
//До ближайшего целого (Round) 
// Math.round() округляет по математическим правилам.
 // Так как дробная часть (.58884) больше 0.5, округление идет вверх до 33.
console.log(Math.round(num));